Microchip-MPLAB-Harmony/bootloader_apps_uart/apps/mpu_uart_bootloader/bootloader_serial_flash/firmware/src/packs/ATSAMA5D29_DFP/component/mcan.h
/* -------- MCAN_PSR : (MCAN Offset: 0x44) ( R/ 32) Protocol Status Register -------- */
#define MCAN_PSR_LEC_Pos                      _UINT32_(0)                                          /* (MCAN_PSR) Last Error Code (set to 111 on read) Position */
#define MCAN_PSR_LEC_Msk                      (_UINT32_(0x7) << MCAN_PSR_LEC_Pos)                  /* (MCAN_PSR) Last Error Code (set to 111 on read) Mask */
#define MCAN_PSR_LEC(value)                   (MCAN_PSR_LEC_Msk & (_UINT32_(value) << MCAN_PSR_LEC_Pos)) /* Assigment of value for LEC in the MCAN_PSR register */
#define   MCAN_PSR_LEC_NO_ERROR_Val           _UINT32_(0x0)                                        /* (MCAN_PSR) No error occurred since LEC has been reset by successful reception or transmission.  */
#define   MCAN_PSR_LEC_STUFF_ERROR_Val        _UINT32_(0x1)                                        /* (MCAN_PSR) More than 5 equal bits in a sequence have occurred in a part of a received message where this is not allowed.  */
#define   MCAN_PSR_LEC_FORM_ERROR_Val         _UINT32_(0x2)                                        /* (MCAN_PSR) A fixed format part of a received frame has the wrong format.  */
#define   MCAN_PSR_LEC_ACK_ERROR_Val          _UINT32_(0x3)                                        /* (MCAN_PSR) The message transmitted by the MCAN was not acknowledged by another node.  */
#define   MCAN_PSR_LEC_BIT1_ERROR_Val         _UINT32_(0x4)                                        /* (MCAN_PSR) During transmission of a message (with the exception of the arbitration field), the device tried to send a recessive level (bit of logical value '1'), but the monitored bus value was dominant.  */
#define   MCAN_PSR_LEC_BIT0_ERROR_Val         _UINT32_(0x5)                                        /* (MCAN_PSR) During transmission of a message (or acknowledge bit, or active error flag, or overload flag), the device tried to send a dominant level (data or identifier bit logical value '0'), but the monitored bus value was recessive. During Bus_Off recovery, this status is set each time a sequence of 11 recessive bits has been monitored. This enables the processor to monitor the proceeding of the Bus_Off recovery sequence (indicating the bus is not stuck at dominant or continuously disturbed).  */
#define   MCAN_PSR_LEC_CRC_ERROR_Val          _UINT32_(0x6)                                        /* (MCAN_PSR) The CRC check sum of a received message was incorrect. The CRC of an incoming message does not match the CRC calculated from the received data.  */
#define   MCAN_PSR_LEC_NO_CHANGE_Val          _UINT32_(0x7)                                        /* (MCAN_PSR) Any read access to the Protocol Status Register re-initializes the LEC to '7'. When the LEC shows value '7', no CAN bus event was detected since the last processor read access to the Protocol Status Register.  */
#define MCAN_PSR_LEC_NO_ERROR                 (MCAN_PSR_LEC_NO_ERROR_Val << MCAN_PSR_LEC_Pos)      /* (MCAN_PSR) No error occurred since LEC has been reset by successful reception or transmission. Position  */
#define MCAN_PSR_LEC_STUFF_ERROR              (MCAN_PSR_LEC_STUFF_ERROR_Val << MCAN_PSR_LEC_Pos)   /* (MCAN_PSR) More than 5 equal bits in a sequence have occurred in a part of a received message where this is not allowed. Position  */
#define MCAN_PSR_LEC_FORM_ERROR               (MCAN_PSR_LEC_FORM_ERROR_Val << MCAN_PSR_LEC_Pos)    /* (MCAN_PSR) A fixed format part of a received frame has the wrong format. Position  */
#define MCAN_PSR_LEC_ACK_ERROR                (MCAN_PSR_LEC_ACK_ERROR_Val << MCAN_PSR_LEC_Pos)     /* (MCAN_PSR) The message transmitted by the MCAN was not acknowledged by another node. Position  */
#define MCAN_PSR_LEC_BIT1_ERROR               (MCAN_PSR_LEC_BIT1_ERROR_Val << MCAN_PSR_LEC_Pos)    /* (MCAN_PSR) During transmission of a message (with the exception of the arbitration field), the device tried to send a recessive level (bit of logical value '1'), but the monitored bus value was dominant. Position  */
#define MCAN_PSR_LEC_BIT0_ERROR               (MCAN_PSR_LEC_BIT0_ERROR_Val << MCAN_PSR_LEC_Pos)    /* (MCAN_PSR) During transmission of a message (or acknowledge bit, or active error flag, or overload flag), the device tried to send a dominant level (data or identifier bit logical value '0'), but the monitored bus value was recessive. During Bus_Off recovery, this status is set each time a sequence of 11 recessive bits has been monitored. This enables the processor to monitor the proceeding of the Bus_Off recovery sequence (indicating the bus is not stuck at dominant or continuously disturbed). Position  */
#define MCAN_PSR_LEC_CRC_ERROR                (MCAN_PSR_LEC_CRC_ERROR_Val << MCAN_PSR_LEC_Pos)     /* (MCAN_PSR) The CRC check sum of a received message was incorrect. The CRC of an incoming message does not match the CRC calculated from the received data. Position  */
#define MCAN_PSR_LEC_NO_CHANGE                (MCAN_PSR_LEC_NO_CHANGE_Val << MCAN_PSR_LEC_Pos)     /* (MCAN_PSR) Any read access to the Protocol Status Register re-initializes the LEC to '7'. When the LEC shows value '7', no CAN bus event was detected since the last processor read access to the Protocol Status Register. Position  */
#define MCAN_PSR_ACT_Pos                      _UINT32_(3)                                          /* (MCAN_PSR) Activity Position */
#define MCAN_PSR_ACT_Msk                      (_UINT32_(0x3) << MCAN_PSR_ACT_Pos)                  /* (MCAN_PSR) Activity Mask */
#define MCAN_PSR_ACT(value)                   (MCAN_PSR_ACT_Msk & (_UINT32_(value) << MCAN_PSR_ACT_Pos)) /* Assigment of value for ACT in the MCAN_PSR register */
#define   MCAN_PSR_ACT_SYNCHRONIZING_Val      _UINT32_(0x0)                                        /* (MCAN_PSR) Node is synchronizing on CAN communication  */
#define   MCAN_PSR_ACT_IDLE_Val               _UINT32_(0x1)                                        /* (MCAN_PSR) Node is neither receiver nor transmitter  */
#define   MCAN_PSR_ACT_RECEIVER_Val           _UINT32_(0x2)                                        /* (MCAN_PSR) Node is operating as receiver  */
#define   MCAN_PSR_ACT_TRANSMITTER_Val        _UINT32_(0x3)                                        /* (MCAN_PSR) Node is operating as transmitter  */
#define MCAN_PSR_ACT_SYNCHRONIZING            (MCAN_PSR_ACT_SYNCHRONIZING_Val << MCAN_PSR_ACT_Pos) /* (MCAN_PSR) Node is synchronizing on CAN communication Position  */
#define MCAN_PSR_ACT_IDLE                     (MCAN_PSR_ACT_IDLE_Val << MCAN_PSR_ACT_Pos)          /* (MCAN_PSR) Node is neither receiver nor transmitter Position  */
#define MCAN_PSR_ACT_RECEIVER                 (MCAN_PSR_ACT_RECEIVER_Val << MCAN_PSR_ACT_Pos)      /* (MCAN_PSR) Node is operating as receiver Position  */
#define MCAN_PSR_ACT_TRANSMITTER              (MCAN_PSR_ACT_TRANSMITTER_Val << MCAN_PSR_ACT_Pos)   /* (MCAN_PSR) Node is operating as transmitter Position  */
#define MCAN_PSR_EP_Pos                       _UINT32_(5)                                          /* (MCAN_PSR) Error Passive Position */
#define MCAN_PSR_EP_Msk                       (_UINT32_(0x1) << MCAN_PSR_EP_Pos)                   /* (MCAN_PSR) Error Passive Mask */
#define MCAN_PSR_EP(value)                    (MCAN_PSR_EP_Msk & (_UINT32_(value) << MCAN_PSR_EP_Pos)) /* Assigment of value for EP in the MCAN_PSR register */
#define MCAN_PSR_EW_Pos                       _UINT32_(6)                                          /* (MCAN_PSR) Warning Status Position */
#define MCAN_PSR_EW_Msk                       (_UINT32_(0x1) << MCAN_PSR_EW_Pos)                   /* (MCAN_PSR) Warning Status Mask */
#define MCAN_PSR_EW(value)                    (MCAN_PSR_EW_Msk & (_UINT32_(value) << MCAN_PSR_EW_Pos)) /* Assigment of value for EW in the MCAN_PSR register */
#define MCAN_PSR_BO_Pos                       _UINT32_(7)                                          /* (MCAN_PSR) Bus_Off Status Position */
#define MCAN_PSR_BO_Msk                       (_UINT32_(0x1) << MCAN_PSR_BO_Pos)                   /* (MCAN_PSR) Bus_Off Status Mask */
#define MCAN_PSR_BO(value)                    (MCAN_PSR_BO_Msk & (_UINT32_(value) << MCAN_PSR_BO_Pos)) /* Assigment of value for BO in the MCAN_PSR register */
#define MCAN_PSR_DLEC_Pos                     _UINT32_(8)                                          /* (MCAN_PSR) Data Phase Last Error Code (set to 111 on read) Position */
#define MCAN_PSR_DLEC_Msk                     (_UINT32_(0x7) << MCAN_PSR_DLEC_Pos)                 /* (MCAN_PSR) Data Phase Last Error Code (set to 111 on read) Mask */
#define MCAN_PSR_DLEC(value)                  (MCAN_PSR_DLEC_Msk & (_UINT32_(value) << MCAN_PSR_DLEC_Pos)) /* Assigment of value for DLEC in the MCAN_PSR register */
#define MCAN_PSR_RESI_Pos                     _UINT32_(11)                                         /* (MCAN_PSR) ESI Flag of Last Received CAN FD Message (cleared on read) Position */
#define MCAN_PSR_RESI_Msk                     (_UINT32_(0x1) << MCAN_PSR_RESI_Pos)                 /* (MCAN_PSR) ESI Flag of Last Received CAN FD Message (cleared on read) Mask */
#define MCAN_PSR_RESI(value)                  (MCAN_PSR_RESI_Msk & (_UINT32_(value) << MCAN_PSR_RESI_Pos)) /* Assigment of value for RESI in the MCAN_PSR register */
#define MCAN_PSR_RBRS_Pos                     _UINT32_(12)                                         /* (MCAN_PSR) BRS Flag of Last Received CAN FD Message (cleared on read) Position */
#define MCAN_PSR_RBRS_Msk                     (_UINT32_(0x1) << MCAN_PSR_RBRS_Pos)                 /* (MCAN_PSR) BRS Flag of Last Received CAN FD Message (cleared on read) Mask */
#define MCAN_PSR_RBRS(value)                  (MCAN_PSR_RBRS_Msk & (_UINT32_(value) << MCAN_PSR_RBRS_Pos)) /* Assigment of value for RBRS in the MCAN_PSR register */
#define MCAN_PSR_RFDF_Pos                     _UINT32_(13)                                         /* (MCAN_PSR) Received a CAN FD Message (cleared on read) Position */
#define MCAN_PSR_RFDF_Msk                     (_UINT32_(0x1) << MCAN_PSR_RFDF_Pos)                 /* (MCAN_PSR) Received a CAN FD Message (cleared on read) Mask */
#define MCAN_PSR_RFDF(value)                  (MCAN_PSR_RFDF_Msk & (_UINT32_(value) << MCAN_PSR_RFDF_Pos)) /* Assigment of value for RFDF in the MCAN_PSR register */
#define MCAN_PSR_PXE_Pos                      _UINT32_(14)                                         /* (MCAN_PSR) Protocol Exception Event (cleared on read) Position */
#define MCAN_PSR_PXE_Msk                      (_UINT32_(0x1) << MCAN_PSR_PXE_Pos)                  /* (MCAN_PSR) Protocol Exception Event (cleared on read) Mask */
#define MCAN_PSR_PXE(value)                   (MCAN_PSR_PXE_Msk & (_UINT32_(value) << MCAN_PSR_PXE_Pos)) /* Assigment of value for PXE in the MCAN_PSR register */
#define MCAN_PSR_TDCV_Pos                     _UINT32_(16)                                         /* (MCAN_PSR) Transmitter Delay Compensation Value Position */
#define MCAN_PSR_TDCV_Msk                     (_UINT32_(0x7F) << MCAN_PSR_TDCV_Pos)                /* (MCAN_PSR) Transmitter Delay Compensation Value Mask */
#define MCAN_PSR_TDCV(value)                  (MCAN_PSR_TDCV_Msk & (_UINT32_(value) << MCAN_PSR_TDCV_Pos)) /* Assigment of value for TDCV in the MCAN_PSR register */
#define MCAN_PSR_Msk                          _UINT32_(0x007F7FFF)                                 /* (MCAN_PSR) Register Mask  */


