Microchip-MPLAB-Harmony/bootloader_apps_uart/apps/mpu_uart_bootloader/bootloader_serial_flash/firmware/src/packs/ATSAMA5D29_DFP/component/mcan.h
/* -------- MCAN_NDAT1 : (MCAN Offset: 0x98) (R/W 32) New Data 1 Register -------- */
#define MCAN_NDAT1_ND0_Pos                    _UINT32_(0)                                          /* (MCAN_NDAT1) New Data Position */
#define MCAN_NDAT1_ND0_Msk                    (_UINT32_(0x1) << MCAN_NDAT1_ND0_Pos)                /* (MCAN_NDAT1) New Data Mask */
#define MCAN_NDAT1_ND0(value)                 (MCAN_NDAT1_ND0_Msk & (_UINT32_(value) << MCAN_NDAT1_ND0_Pos)) /* Assigment of value for ND0 in the MCAN_NDAT1 register */
#define MCAN_NDAT1_ND1_Pos                    _UINT32_(1)                                          /* (MCAN_NDAT1) New Data Position */
#define MCAN_NDAT1_ND1_Msk                    (_UINT32_(0x1) << MCAN_NDAT1_ND1_Pos)                /* (MCAN_NDAT1) New Data Mask */
#define MCAN_NDAT1_ND1(value)                 (MCAN_NDAT1_ND1_Msk & (_UINT32_(value) << MCAN_NDAT1_ND1_Pos)) /* Assigment of value for ND1 in the MCAN_NDAT1 register */
#define MCAN_NDAT1_ND2_Pos                    _UINT32_(2)                                          /* (MCAN_NDAT1) New Data Position */
#define MCAN_NDAT1_ND2_Msk                    (_UINT32_(0x1) << MCAN_NDAT1_ND2_Pos)                /* (MCAN_NDAT1) New Data Mask */
#define MCAN_NDAT1_ND2(value)                 (MCAN_NDAT1_ND2_Msk & (_UINT32_(value) << MCAN_NDAT1_ND2_Pos)) /* Assigment of value for ND2 in the MCAN_NDAT1 register */
#define MCAN_NDAT1_ND3_Pos                    _UINT32_(3)                                          /* (MCAN_NDAT1) New Data Position */
#define MCAN_NDAT1_ND3_Msk                    (_UINT32_(0x1) << MCAN_NDAT1_ND3_Pos)                /* (MCAN_NDAT1) New Data Mask */
#define MCAN_NDAT1_ND3(value)                 (MCAN_NDAT1_ND3_Msk & (_UINT32_(value) << MCAN_NDAT1_ND3_Pos)) /* Assigment of value for ND3 in the MCAN_NDAT1 register */
#define MCAN_NDAT1_ND4_Pos                    _UINT32_(4)                                          /* (MCAN_NDAT1) New Data Position */
#define MCAN_NDAT1_ND4_Msk                    (_UINT32_(0x1) << MCAN_NDAT1_ND4_Pos)                /* (MCAN_NDAT1) New Data Mask */
#define MCAN_NDAT1_ND4(value)                 (MCAN_NDAT1_ND4_Msk & (_UINT32_(value) << MCAN_NDAT1_ND4_Pos)) /* Assigment of value for ND4 in the MCAN_NDAT1 register */
#define MCAN_NDAT1_ND5_Pos                    _UINT32_(5)                                          /* (MCAN_NDAT1) New Data Position */
#define MCAN_NDAT1_ND5_Msk                    (_UINT32_(0x1) << MCAN_NDAT1_ND5_Pos)                /* (MCAN_NDAT1) New Data Mask */
#define MCAN_NDAT1_ND5(value)                 (MCAN_NDAT1_ND5_Msk & (_UINT32_(value) << MCAN_NDAT1_ND5_Pos)) /* Assigment of value for ND5 in the MCAN_NDAT1 register */
#define MCAN_NDAT1_ND6_Pos                    _UINT32_(6)                                          /* (MCAN_NDAT1) New Data Position */
#define MCAN_NDAT1_ND6_Msk                    (_UINT32_(0x1) << MCAN_NDAT1_ND6_Pos)                /* (MCAN_NDAT1) New Data Mask */
#define MCAN_NDAT1_ND6(value)                 (MCAN_NDAT1_ND6_Msk & (_UINT32_(value) << MCAN_NDAT1_ND6_Pos)) /* Assigment of value for ND6 in the MCAN_NDAT1 register */
#define MCAN_NDAT1_ND7_Pos                    _UINT32_(7)                                          /* (MCAN_NDAT1) New Data Position */
#define MCAN_NDAT1_ND7_Msk                    (_UINT32_(0x1) << MCAN_NDAT1_ND7_Pos)                /* (MCAN_NDAT1) New Data Mask */
#define MCAN_NDAT1_ND7(value)                 (MCAN_NDAT1_ND7_Msk & (_UINT32_(value) << MCAN_NDAT1_ND7_Pos)) /* Assigment of value for ND7 in the MCAN_NDAT1 register */
#define MCAN_NDAT1_ND8_Pos                    _UINT32_(8)                                          /* (MCAN_NDAT1) New Data Position */
#define MCAN_NDAT1_ND8_Msk                    (_UINT32_(0x1) << MCAN_NDAT1_ND8_Pos)                /* (MCAN_NDAT1) New Data Mask */
#define MCAN_NDAT1_ND8(value)                 (MCAN_NDAT1_ND8_Msk & (_UINT32_(value) << MCAN_NDAT1_ND8_Pos)) /* Assigment of value for ND8 in the MCAN_NDAT1 register */
#define MCAN_NDAT1_ND9_Pos                    _UINT32_(9)                                          /* (MCAN_NDAT1) New Data Position */
#define MCAN_NDAT1_ND9_Msk                    (_UINT32_(0x1) << MCAN_NDAT1_ND9_Pos)                /* (MCAN_NDAT1) New Data Mask */
#define MCAN_NDAT1_ND9(value)                 (MCAN_NDAT1_ND9_Msk & (_UINT32_(value) << MCAN_NDAT1_ND9_Pos)) /* Assigment of value for ND9 in the MCAN_NDAT1 register */
#define MCAN_NDAT1_ND10_Pos                   _UINT32_(10)                                         /* (MCAN_NDAT1) New Data Position */
#define MCAN_NDAT1_ND10_Msk                   (_UINT32_(0x1) << MCAN_NDAT1_ND10_Pos)               /* (MCAN_NDAT1) New Data Mask */
#define MCAN_NDAT1_ND10(value)                (MCAN_NDAT1_ND10_Msk & (_UINT32_(value) << MCAN_NDAT1_ND10_Pos)) /* Assigment of value for ND10 in the MCAN_NDAT1 register */
#define MCAN_NDAT1_ND11_Pos                   _UINT32_(11)                                         /* (MCAN_NDAT1) New Data Position */
#define MCAN_NDAT1_ND11_Msk                   (_UINT32_(0x1) << MCAN_NDAT1_ND11_Pos)               /* (MCAN_NDAT1) New Data Mask */
#define MCAN_NDAT1_ND11(value)                (MCAN_NDAT1_ND11_Msk & (_UINT32_(value) << MCAN_NDAT1_ND11_Pos)) /* Assigment of value for ND11 in the MCAN_NDAT1 register */
#define MCAN_NDAT1_ND12_Pos                   _UINT32_(12)                                         /* (MCAN_NDAT1) New Data Position */
#define MCAN_NDAT1_ND12_Msk                   (_UINT32_(0x1) << MCAN_NDAT1_ND12_Pos)               /* (MCAN_NDAT1) New Data Mask */
#define MCAN_NDAT1_ND12(value)                (MCAN_NDAT1_ND12_Msk & (_UINT32_(value) << MCAN_NDAT1_ND12_Pos)) /* Assigment of value for ND12 in the MCAN_NDAT1 register */
#define MCAN_NDAT1_ND13_Pos                   _UINT32_(13)                                         /* (MCAN_NDAT1) New Data Position */
#define MCAN_NDAT1_ND13_Msk                   (_UINT32_(0x1) << MCAN_NDAT1_ND13_Pos)               /* (MCAN_NDAT1) New Data Mask */
#define MCAN_NDAT1_ND13(value)                (MCAN_NDAT1_ND13_Msk & (_UINT32_(value) << MCAN_NDAT1_ND13_Pos)) /* Assigment of value for ND13 in the MCAN_NDAT1 register */
#define MCAN_NDAT1_ND14_Pos                   _UINT32_(14)                                         /* (MCAN_NDAT1) New Data Position */
#define MCAN_NDAT1_ND14_Msk                   (_UINT32_(0x1) << MCAN_NDAT1_ND14_Pos)               /* (MCAN_NDAT1) New Data Mask */
#define MCAN_NDAT1_ND14(value)                (MCAN_NDAT1_ND14_Msk & (_UINT32_(value) << MCAN_NDAT1_ND14_Pos)) /* Assigment of value for ND14 in the MCAN_NDAT1 register */
#define MCAN_NDAT1_ND15_Pos                   _UINT32_(15)                                         /* (MCAN_NDAT1) New Data Position */
#define MCAN_NDAT1_ND15_Msk                   (_UINT32_(0x1) << MCAN_NDAT1_ND15_Pos)               /* (MCAN_NDAT1) New Data Mask */
#define MCAN_NDAT1_ND15(value)                (MCAN_NDAT1_ND15_Msk & (_UINT32_(value) << MCAN_NDAT1_ND15_Pos)) /* Assigment of value for ND15 in the MCAN_NDAT1 register */
#define MCAN_NDAT1_ND16_Pos                   _UINT32_(16)                                         /* (MCAN_NDAT1) New Data Position */
#define MCAN_NDAT1_ND16_Msk                   (_UINT32_(0x1) << MCAN_NDAT1_ND16_Pos)               /* (MCAN_NDAT1) New Data Mask */
#define MCAN_NDAT1_ND16(value)                (MCAN_NDAT1_ND16_Msk & (_UINT32_(value) << MCAN_NDAT1_ND16_Pos)) /* Assigment of value for ND16 in the MCAN_NDAT1 register */
#define MCAN_NDAT1_ND17_Pos                   _UINT32_(17)                                         /* (MCAN_NDAT1) New Data Position */
#define MCAN_NDAT1_ND17_Msk                   (_UINT32_(0x1) << MCAN_NDAT1_ND17_Pos)               /* (MCAN_NDAT1) New Data Mask */
#define MCAN_NDAT1_ND17(value)                (MCAN_NDAT1_ND17_Msk & (_UINT32_(value) << MCAN_NDAT1_ND17_Pos)) /* Assigment of value for ND17 in the MCAN_NDAT1 register */
#define MCAN_NDAT1_ND18_Pos                   _UINT32_(18)                                         /* (MCAN_NDAT1) New Data Position */
#define MCAN_NDAT1_ND18_Msk                   (_UINT32_(0x1) << MCAN_NDAT1_ND18_Pos)               /* (MCAN_NDAT1) New Data Mask */
#define MCAN_NDAT1_ND18(value)                (MCAN_NDAT1_ND18_Msk & (_UINT32_(value) << MCAN_NDAT1_ND18_Pos)) /* Assigment of value for ND18 in the MCAN_NDAT1 register */
#define MCAN_NDAT1_ND19_Pos                   _UINT32_(19)                                         /* (MCAN_NDAT1) New Data Position */
#define MCAN_NDAT1_ND19_Msk                   (_UINT32_(0x1) << MCAN_NDAT1_ND19_Pos)               /* (MCAN_NDAT1) New Data Mask */
#define MCAN_NDAT1_ND19(value)                (MCAN_NDAT1_ND19_Msk & (_UINT32_(value) << MCAN_NDAT1_ND19_Pos)) /* Assigment of value for ND19 in the MCAN_NDAT1 register */
#define MCAN_NDAT1_ND20_Pos                   _UINT32_(20)                                         /* (MCAN_NDAT1) New Data Position */
#define MCAN_NDAT1_ND20_Msk                   (_UINT32_(0x1) << MCAN_NDAT1_ND20_Pos)               /* (MCAN_NDAT1) New Data Mask */
#define MCAN_NDAT1_ND20(value)                (MCAN_NDAT1_ND20_Msk & (_UINT32_(value) << MCAN_NDAT1_ND20_Pos)) /* Assigment of value for ND20 in the MCAN_NDAT1 register */
#define MCAN_NDAT1_ND21_Pos                   _UINT32_(21)                                         /* (MCAN_NDAT1) New Data Position */
#define MCAN_NDAT1_ND21_Msk                   (_UINT32_(0x1) << MCAN_NDAT1_ND21_Pos)               /* (MCAN_NDAT1) New Data Mask */
#define MCAN_NDAT1_ND21(value)                (MCAN_NDAT1_ND21_Msk & (_UINT32_(value) << MCAN_NDAT1_ND21_Pos)) /* Assigment of value for ND21 in the MCAN_NDAT1 register */
#define MCAN_NDAT1_ND22_Pos                   _UINT32_(22)                                         /* (MCAN_NDAT1) New Data Position */
#define MCAN_NDAT1_ND22_Msk                   (_UINT32_(0x1) << MCAN_NDAT1_ND22_Pos)               /* (MCAN_NDAT1) New Data Mask */
#define MCAN_NDAT1_ND22(value)                (MCAN_NDAT1_ND22_Msk & (_UINT32_(value) << MCAN_NDAT1_ND22_Pos)) /* Assigment of value for ND22 in the MCAN_NDAT1 register */
#define MCAN_NDAT1_ND23_Pos                   _UINT32_(23)                                         /* (MCAN_NDAT1) New Data Position */
#define MCAN_NDAT1_ND23_Msk                   (_UINT32_(0x1) << MCAN_NDAT1_ND23_Pos)               /* (MCAN_NDAT1) New Data Mask */
#define MCAN_NDAT1_ND23(value)                (MCAN_NDAT1_ND23_Msk & (_UINT32_(value) << MCAN_NDAT1_ND23_Pos)) /* Assigment of value for ND23 in the MCAN_NDAT1 register */
#define MCAN_NDAT1_ND24_Pos                   _UINT32_(24)                                         /* (MCAN_NDAT1) New Data Position */
#define MCAN_NDAT1_ND24_Msk                   (_UINT32_(0x1) << MCAN_NDAT1_ND24_Pos)               /* (MCAN_NDAT1) New Data Mask */
#define MCAN_NDAT1_ND24(value)                (MCAN_NDAT1_ND24_Msk & (_UINT32_(value) << MCAN_NDAT1_ND24_Pos)) /* Assigment of value for ND24 in the MCAN_NDAT1 register */
#define MCAN_NDAT1_ND25_Pos                   _UINT32_(25)                                         /* (MCAN_NDAT1) New Data Position */
#define MCAN_NDAT1_ND25_Msk                   (_UINT32_(0x1) << MCAN_NDAT1_ND25_Pos)               /* (MCAN_NDAT1) New Data Mask */
#define MCAN_NDAT1_ND25(value)                (MCAN_NDAT1_ND25_Msk & (_UINT32_(value) << MCAN_NDAT1_ND25_Pos)) /* Assigment of value for ND25 in the MCAN_NDAT1 register */
#define MCAN_NDAT1_ND26_Pos                   _UINT32_(26)                                         /* (MCAN_NDAT1) New Data Position */
#define MCAN_NDAT1_ND26_Msk                   (_UINT32_(0x1) << MCAN_NDAT1_ND26_Pos)               /* (MCAN_NDAT1) New Data Mask */
#define MCAN_NDAT1_ND26(value)                (MCAN_NDAT1_ND26_Msk & (_UINT32_(value) << MCAN_NDAT1_ND26_Pos)) /* Assigment of value for ND26 in the MCAN_NDAT1 register */
#define MCAN_NDAT1_ND27_Pos                   _UINT32_(27)                                         /* (MCAN_NDAT1) New Data Position */
#define MCAN_NDAT1_ND27_Msk                   (_UINT32_(0x1) << MCAN_NDAT1_ND27_Pos)               /* (MCAN_NDAT1) New Data Mask */
#define MCAN_NDAT1_ND27(value)                (MCAN_NDAT1_ND27_Msk & (_UINT32_(value) << MCAN_NDAT1_ND27_Pos)) /* Assigment of value for ND27 in the MCAN_NDAT1 register */
#define MCAN_NDAT1_ND28_Pos                   _UINT32_(28)                                         /* (MCAN_NDAT1) New Data Position */
#define MCAN_NDAT1_ND28_Msk                   (_UINT32_(0x1) << MCAN_NDAT1_ND28_Pos)               /* (MCAN_NDAT1) New Data Mask */
#define MCAN_NDAT1_ND28(value)                (MCAN_NDAT1_ND28_Msk & (_UINT32_(value) << MCAN_NDAT1_ND28_Pos)) /* Assigment of value for ND28 in the MCAN_NDAT1 register */
#define MCAN_NDAT1_ND29_Pos                   _UINT32_(29)                                         /* (MCAN_NDAT1) New Data Position */
#define MCAN_NDAT1_ND29_Msk                   (_UINT32_(0x1) << MCAN_NDAT1_ND29_Pos)               /* (MCAN_NDAT1) New Data Mask */
#define MCAN_NDAT1_ND29(value)                (MCAN_NDAT1_ND29_Msk & (_UINT32_(value) << MCAN_NDAT1_ND29_Pos)) /* Assigment of value for ND29 in the MCAN_NDAT1 register */
#define MCAN_NDAT1_ND30_Pos                   _UINT32_(30)                                         /* (MCAN_NDAT1) New Data Position */
#define MCAN_NDAT1_ND30_Msk                   (_UINT32_(0x1) << MCAN_NDAT1_ND30_Pos)               /* (MCAN_NDAT1) New Data Mask */
#define MCAN_NDAT1_ND30(value)                (MCAN_NDAT1_ND30_Msk & (_UINT32_(value) << MCAN_NDAT1_ND30_Pos)) /* Assigment of value for ND30 in the MCAN_NDAT1 register */
#define MCAN_NDAT1_ND31_Pos                   _UINT32_(31)                                         /* (MCAN_NDAT1) New Data Position */
#define MCAN_NDAT1_ND31_Msk                   (_UINT32_(0x1) << MCAN_NDAT1_ND31_Pos)               /* (MCAN_NDAT1) New Data Mask */
#define MCAN_NDAT1_ND31(value)                (MCAN_NDAT1_ND31_Msk & (_UINT32_(value) << MCAN_NDAT1_ND31_Pos)) /* Assigment of value for ND31 in the MCAN_NDAT1 register */
#define MCAN_NDAT1_Msk                        _UINT32_(0xFFFFFFFF)                                 /* (MCAN_NDAT1) Register Mask  */

#define MCAN_NDAT1_ND_Pos                     _UINT32_(0)                                          /* (MCAN_NDAT1 Position) New Data */
#define MCAN_NDAT1_ND_Msk                     (_UINT32_(0xFFFFFFFF) << MCAN_NDAT1_ND_Pos)          /* (MCAN_NDAT1 Mask) ND */
#define MCAN_NDAT1_ND(value)                  (MCAN_NDAT1_ND_Msk & (_UINT32_(value) << MCAN_NDAT1_ND_Pos)) 

